// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"


// let login = prompt("Enter your login:");
// if (login === null) {
//     alert("Скасовано");
// }
// let password;
// if (login === "Адмін") {
//     password = prompt("Enter your password:");
//     if (password === null) {
//         alert("Скасовано");
//     } else if (password === "Я головний") {
//         alert("Добрий день!");
//     } else {
//         alert("Невірний пароль!");
//     }
// }
// console.log(login);
